## Ordinal encoding

- The labels can be ordered 
- Assign numbers to categories 

### Pros

- Keeps variables semantic 
- Easy

In [416]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np
import datetime

In [417]:
from google.colab import drive
drive.mount('/content/gdrive')
data = pd.read_csv("gdrive/My Drive/Colab Notebooks/FeatureEngineering/train_date.csv")

Drive already mounted at /content/gdrive; to attempt to forcibly remount, call drive.mount("/content/gdrive", force_remount=True).

In [418]:
data.head()

         Date  PassengerId  Survived  ...     Fare Cabin Embarked
0   12/6/2019            1         0  ...   7.2500   NaN        S
1   12/7/2019            2         1  ...  71.2833   C85        C
2   12/8/2019            3         1  ...   7.9250   NaN        S
3   12/9/2019            4         1  ...  53.1000  C123        S
4  12/10/2019            5         0  ...   8.0500   NaN        S

[5 rows x 13 columns]

In [419]:
data.columns

Index(['Date', 'PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age',
       'SibSp', 'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [424]:
data['Date'] = pd.to_datetime(data['Date'])
data.head()

        Date  PassengerId  Survived  ...     Fare Cabin Embarked
0 2019-12-06            1         0  ...   7.2500   NaN        S
1 2019-12-07            2         1  ...  71.2833   C85        C
2 2019-12-08            3         1  ...   7.9250   NaN        S
3 2019-12-09            4         1  ...  53.1000  C123        S
4 2019-12-10            5         0  ...   8.0500   NaN        S

[5 rows x 13 columns]

In [426]:
type(data['Date'][0])

pandas._libs.tslibs.timestamps.Timestamp

In [428]:
data['Date'][0].weekday

In [430]:
data['year'] = pd.DatetimeIndex(data['Date']).year

In [431]:
data.head()

        Date  PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked  year
0 2019-12-06            1         0       3  ...   7.2500   NaN         S  2019
1 2019-12-07            2         1       1  ...  71.2833   C85         C  2019
2 2019-12-08            3         1       3  ...   7.9250   NaN         S  2019
3 2019-12-09            4         1       1  ...  53.1000  C123         S  2019
4 2019-12-10            5         0       3  ...   8.0500   NaN         S  2019

[5 rows x 14 columns]

In [432]:
data['day'] = pd.DatetimeIndex(data['Date']).day

In [433]:
data.head()

        Date  PassengerId  Survived  Pclass  ... Cabin Embarked  year  day
0 2019-12-06            1         0       3  ...   NaN        S  2019    6
1 2019-12-07            2         1       1  ...   C85        C  2019    7
2 2019-12-08            3         1       3  ...   NaN        S  2019    8
3 2019-12-09            4         1       1  ...  C123        S  2019    9
4 2019-12-10            5         0       3  ...   NaN        S  2019   10

[5 rows x 15 columns]